; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   microwavetype sinkbasintype fridgetype - receptacletype
   knifetype butterknifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   towelholdertype carttype toiletpaperhangertype safetype cabinettype - receptacletype
   candletype potatotype lettucetype platetype mugtype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 - location
   towelholder_1 cart_2 toiletpaperhanger_3 safe_4 cabinet_5 microwave_6 fridge_7 - receptacle
   candle_1 potato_2 lettuce_3 plate_4 mug_5 - obj
 )
 (:init (receptacletype_0 towelholder_1 towelholdertype) (receptacletype_0 cart_2 carttype) (receptacletype_0 toiletpaperhanger_3 toiletpaperhangertype) (receptacletype_0 safe_4 safetype) (receptacletype_0 cabinet_5 cabinettype) (receptacletype_0 microwave_6 microwavetype) (receptacletype_0 fridge_7 fridgetype) (objecttype_0 candle_1 candletype) (objecttype_0 potato_2 potatotype) (objecttype_0 lettuce_3 lettucetype) (objecttype_0 plate_4 platetype) (objecttype_0 mug_5 mugtype) (cancontain carttype candletype) (cancontain carttype mugtype) (cancontain cabinettype candletype) (cancontain cabinettype platetype) (cancontain cabinettype mugtype) (cancontain microwavetype potatotype) (cancontain microwavetype platetype) (cancontain microwavetype mugtype) (cancontain fridgetype potatotype) (cancontain fridgetype lettucetype) (cancontain fridgetype platetype) (cancontain fridgetype mugtype) (pickupable candle_1) (pickupable potato_2) (cleanable potato_2) (heatable potato_2) (coolable potato_2) (sliceable potato_2) (pickupable lettuce_3) (cleanable lettuce_3) (coolable lettuce_3) (sliceable lettuce_3) (pickupable plate_4) (isreceptacleobject plate_4) (cleanable plate_4) (heatable plate_4) (coolable plate_4) (pickupable mug_5) (isreceptacleobject mug_5) (cleanable mug_5) (heatable mug_5) (coolable mug_5) (receptacleatlocation towelholder_1 location1) (receptacleatlocation cart_2 location5) (receptacleatlocation toiletpaperhanger_3 location3) (receptacleatlocation safe_4 location3) (receptacleatlocation cabinet_5 location4) (receptacleatlocation microwave_6 location2) (receptacleatlocation fridge_7 location3) (inreceptacle candle_1 cart_2) (inreceptacle potato_2 fridge_7) (inreceptacle lettuce_3 fridge_7) (inreceptacle plate_4 microwave_6) (inreceptacle mug_5 cart_2) (objectatlocation candle_1 location5) (objectatlocation potato_2 location3) (objectatlocation lettuce_3 location3) (objectatlocation plate_4 location2) (objectatlocation mug_5 location5) (atlocation agent1 location4) (= (total-cost) 0))
 (:goal (and (exists (?r - receptacle)
 (exists (?o - obj)
 (and (heatable ?o) (objecttype_0 ?o mugtype) (receptacletype_0 ?r fridgetype) (ishot ?o) (inreceptacle ?o ?r))))))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location4 location5)
   deleted: (atlocation agent1 location4)
   added: (atlocation agent1 location5)
   goals met: 0 of 1
2. (pickupobject agent1 location5 mug_5 cart_2)
   deleted: (inreceptacle mug_5 cart_2) (objectatlocation mug_5 location5)
   added: (holds agent1 mug_5) (holdsany agent1)
   goals met: 0 of 1
3. (gotolocation agent1 location5 location2)
   deleted: (atlocation agent1 location5)
   added: (atlocation agent1 location2)
   goals met: 0 of 1
4. (heatobject agent1 location2 microwave_6 mug_5)
   added: (ishot mug_5)
   goals met: 0 of 1
5. (gotolocation agent1 location2 location3)
   deleted: (atlocation agent1 location2)
   added: (atlocation agent1 location3)
   goals met: 0 of 1
6. (putobject agent1 location3 mug_5 fridge_7 mugtype fridgetype)
   deleted: (holds agent1 mug_5) (holdsany agent1)
   added: (inreceptacle mug_5 fridge_7) (objectatlocation mug_5 location3)
   goals met: 1 of 1
